---------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  G:\Other computers\Mi portátil\Facultad\Pronosticos\Ejs Pronosticos\EjPronosticos10\Ej10_log.log
  log type:  text
 opened on:   2 Jun 2025, 17:43:19

. 
. clear

. import excel "Ejer_9_.xlsx", firstrow clear
(7 vars, 250 obs)

. 
. * variable tiempo
. tsset obs
        time variable:  obs, 1 to 250
                delta:  1 unit

. 
. *Lags optimos = 1
. dfgls y1
 
DF-GLS for y1                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -3.398           -3.480            -2.805            -2.526
    14           -3.273           -3.480            -2.814            -2.535
    13           -3.335           -3.480            -2.824            -2.544
    12           -3.360           -3.480            -2.833            -2.552
    11           -3.484           -3.480            -2.842            -2.561
    10           -3.682           -3.480            -2.851            -2.569
    9            -3.846           -3.480            -2.860            -2.576
    8            -4.056           -3.480            -2.868            -2.584
    7            -4.628           -3.480            -2.876            -2.591
    6            -4.257           -3.480            -2.884            -2.598
    5            -4.160           -3.480            -2.891            -2.605
    4            -4.080           -3.480            -2.898            -2.611
    3            -4.432           -3.480            -2.905            -2.617
    2            -4.600           -3.480            -2.911            -2.623
    1            -5.076           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) =  8 with RMSE  .7274193
Min SIC  = -.5171291 at lag  1 with RMSE  .7543658
Min MAIC = -.3847533 at lag 11 with RMSE  .7240769

. * tendencia determinística significativa y rechazo no estacionariedad -> es I(0)
. dfuller y1, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -5.142            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0001

------------------------------------------------------------------------------
        D.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         L1. |  -.1924637   .0374331    -5.14   0.000     -.266197   -.1187305
         LD. |   .1018023   .0633135     1.61   0.109    -.0229085     .226513
             |
      _trend |  -.0087543   .0018493    -4.73   0.000    -.0123969   -.0051116
       _cons |  -.5274961   .1326001    -3.98   0.000     -.788683   -.2663092
------------------------------------------------------------------------------

. 
. *Lags optimos = 1
. dfgls y2
 
DF-GLS for y2                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -2.762           -3.480            -2.805            -2.526
    14           -2.797           -3.480            -2.814            -2.535
    13           -2.749           -3.480            -2.824            -2.544
    12           -2.576           -3.480            -2.833            -2.552
    11           -2.730           -3.480            -2.842            -2.561
    10           -2.842           -3.480            -2.851            -2.569
    9            -2.989           -3.480            -2.860            -2.576
    8            -3.308           -3.480            -2.868            -2.584
    7            -3.428           -3.480            -2.876            -2.591
    6            -3.329           -3.480            -2.884            -2.598
    5            -3.329           -3.480            -2.891            -2.605
    4            -3.210           -3.480            -2.898            -2.611
    3            -3.404           -3.480            -2.905            -2.617
    2            -3.452           -3.480            -2.911            -2.623
    1            -3.453           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) = 0 [use maxlag(0)]
Min SIC  = -1.330868 at lag  1 with RMSE  .5022048
Min MAIC = -1.262368 at lag  1 with RMSE  .5022048

. * tendencia determinística significativa y rechazo no estacionariedad -> es I(0)
. dfuller y2, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.913            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0117

------------------------------------------------------------------------------
        D.y2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y2 |
         L1. |  -.1221842   .0312269    -3.91   0.000     -.183693   -.0606755
         LD. |  -.0271179   .0636201    -0.43   0.670    -.1524325    .0981967
             |
      _trend |  -.0053918   .0014973    -3.60   0.000     -.008341   -.0024426
       _cons |  -.3859355   .1014423    -3.80   0.000    -.5857499   -.1861211
------------------------------------------------------------------------------

. 
. tsline y1 y2

. 
. * Lags optimos del var = 1
. varsoc y1 y2

   Selection-order criteria
   Sample:  5 - 250                             Number of obs      =       246
  +---------------------------------------------------------------------------+
  |lag |    LL      LR      df    p      FPE       AIC      HQIC      SBIC    |
  |----+----------------------------------------------------------------------|
  |  0 | -953.218                      8.08688     7.766   7.77747    7.7945  |
  |  1 |  -384.07  1138.3*   4  0.000   .08172    3.1713   3.20573*   3.2568* |
  |  2 | -380.001   8.139    4  0.087  .081675*  3.17074*  3.22811   3.31323  |
  |  3 | -378.351  3.2989    4  0.509  .083253   3.18985   3.27017   3.38934  |
  |  4 |  -377.22  2.2625    4  0.688   .08522   3.21317   3.31645   3.46966  |
  +---------------------------------------------------------------------------+
   Endogenous:  y1 y2
    Exogenous:  _cons

. 
. *Debido a que ya son I(0) no hace falta hacer un VEC.
. *Estimación:
. var y1 y2, lags(1)

Vector autoregression

Sample:  2 - 250                                Number of obs     =        249
Log likelihood =  -387.5059                     AIC               =    3.16069
FPE            =   .0808579                     HQIC              =   3.194806
Det(Sigma_ml)  =   .0770533                     SBIC              =   3.245448

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
y1                    3     .771212   0.9537   5130.903   0.0000
y2                    3     .517394   0.9777   10926.54   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
y1           |
          y1 |
         L1. |   .7777084   .0583023    13.34   0.000      .663438    .8919788
             |
          y2 |
         L1. |   .2057514   .0602914     3.41   0.001     .0875824    .3239205
             |
       _cons |  -.1796292   .1255002    -1.43   0.152    -.4256052    .0663468
-------------+----------------------------------------------------------------
y2           |
          y1 |
         L1. |   .0165773   .0391141     0.42   0.672    -.0600849    .0932396
             |
          y2 |
         L1. |   .9677074   .0404486    23.92   0.000     .8884296    1.046985
             |
       _cons |  -.1824048   .0841962    -2.17   0.030    -.3474262   -.0173833
------------------------------------------------------------------------------

. 
. *Test de autocorrelación de errores. No puedo rechazar no autocorrelación
. varlmar

   Lagrange-multiplier test
  +--------------------------------------+
  | lag  |      chi2    df   Prob > chi2 |
  |------+-------------------------------|
  |   1  |    7.8839     4     0.09592   |
  |   2  |    4.1722     4     0.38321   |
  +--------------------------------------+
   H0: no autocorrelation at lag order

. 
. * Ambas raíces dentro del círculo unitario
. varstable

   Eigenvalue stability condition
  +----------------------------------------+
  |        Eigenvalue        |   Modulus   |
  |--------------------------+-------------|
  |   .9842234               |   .984223   |
  |   .7611923               |   .761192   |
  +----------------------------------------+
   All the eigenvalues lie inside the unit circle.
   VAR satisfies stability condition.

. 
. 
. 
. *** SEGUNDA SIMULACION ***
. import excel "Ejer_9_.xlsx", sheet("Ejercicio 2") firstrow clear
(9 vars, 250 obs)

. 
. * variable tiempo
. tsset obs
        time variable:  obs, 1 to 250
                delta:  1 unit

. 
. *Lags optimos = 1
. dfgls y1
 
DF-GLS for y1                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -3.888           -3.480            -2.805            -2.526
    14           -3.802           -3.480            -2.814            -2.535
    13           -4.047           -3.480            -2.824            -2.544
    12           -3.645           -3.480            -2.833            -2.552
    11           -3.624           -3.480            -2.842            -2.561
    10           -3.901           -3.480            -2.851            -2.569
    9            -4.087           -3.480            -2.860            -2.576
    8            -4.325           -3.480            -2.868            -2.584
    7            -3.986           -3.480            -2.876            -2.591
    6            -4.183           -3.480            -2.884            -2.598
    5            -4.060           -3.480            -2.891            -2.605
    4            -4.019           -3.480            -2.898            -2.611
    3            -3.942           -3.480            -2.905            -2.617
    2            -4.225           -3.480            -2.911            -2.623
    1            -4.620           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) = 13 with RMSE  .5739415
Min SIC  = -.9874086 at lag  1 with RMSE  .5962963
Min MAIC = -.8658729 at lag  3 with RMSE  .5922672

. * tendencia determinística significativa y rechazo no estacionariedad -> es I(0)
. dfuller y1, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -4.085            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0066

------------------------------------------------------------------------------
        D.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         L1. |  -.1487761   .0364166    -4.09   0.000    -.2205072    -.077045
         LD. |  -.0747377   .0632973    -1.18   0.239    -.1994166    .0499412
             |
      _trend |  -.0027272   .0009155    -2.98   0.003    -.0045304    -.000924
       _cons |   .0646372   .0848761     0.76   0.447    -.1025462    .2318206
------------------------------------------------------------------------------

. 
. *Lags optimos = 1
. dfgls y2
 
DF-GLS for y2                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -2.033           -3.480            -2.805            -2.526
    14           -2.248           -3.480            -2.814            -2.535
    13           -2.291           -3.480            -2.824            -2.544
    12           -2.184           -3.480            -2.833            -2.552
    11           -2.225           -3.480            -2.842            -2.561
    10           -2.172           -3.480            -2.851            -2.569
    9            -2.018           -3.480            -2.860            -2.576
    8            -1.983           -3.480            -2.868            -2.584
    7            -2.004           -3.480            -2.876            -2.591
    6            -2.186           -3.480            -2.884            -2.598
    5            -2.120           -3.480            -2.891            -2.605
    4            -2.065           -3.480            -2.898            -2.611
    3            -2.224           -3.480            -2.905            -2.617
    2            -2.312           -3.480            -2.911            -2.623
    1            -2.391           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) = 0 [use maxlag(0)]
Min SIC  = -1.372214 at lag  1 with RMSE  .4919294
Min MAIC = -1.360103 at lag  1 with RMSE  .4919294

. * tendencia determinística significativa y no rechazo no estacionariedad -> es al menos I(1)
. dfuller y2, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.438            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.3598

------------------------------------------------------------------------------
        D.y2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y2 |
         L1. |  -.0546477   .0224173    -2.44   0.015    -.0988038   -.0104916
         LD. |  -.0498937    .062966    -0.79   0.429      -.17392    .0741327
             |
      _trend |    .001696   .0009218     1.84   0.067    -.0001196    .0035117
       _cons |   .2398032   .0948721     2.53   0.012     .0529303     .426676
------------------------------------------------------------------------------

. 
. * No se puede correr el vec si son de distinto orden de integración
. tsline y1 y2 y3

. 
. 
. 
. *** TERCERA SIMULACION ***
. * 1)
. import excel "Ejer_9_.xlsx", sheet("Ejercicio 3") firstrow clear
(11 vars, 250 obs)

. 
. * 2)
. * variable tiempo
. tsset obs
        time variable:  obs, 1 to 250
                delta:  1 unit

. 
. * 3)
. *Lags optimos = 1
. dfgls y1
 
DF-GLS for y1                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.638           -3.480            -2.805            -2.526
    14           -1.666           -3.480            -2.814            -2.535
    13           -1.674           -3.480            -2.824            -2.544
    12           -1.566           -3.480            -2.833            -2.552
    11           -1.592           -3.480            -2.842            -2.561
    10           -1.836           -3.480            -2.851            -2.569
    9            -1.875           -3.480            -2.860            -2.576
    8            -1.960           -3.480            -2.868            -2.584
    7            -2.284           -3.480            -2.876            -2.591
    6            -2.512           -3.480            -2.884            -2.598
    5            -2.710           -3.480            -2.891            -2.605
    4            -2.662           -3.480            -2.898            -2.611
    3            -2.918           -3.480            -2.905            -2.617
    2            -2.975           -3.480            -2.911            -2.623
    1            -3.001           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) = 11 with RMSE  .7221602
Min SIC  = -.5481838 at lag  1 with RMSE   .742743
Min MAIC = -.5262166 at lag 11 with RMSE  .7221602

. * tendencia determinística no significativa
. dfuller y1, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.293            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0674

------------------------------------------------------------------------------
        D.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         L1. |  -.0855993   .0259941    -3.29   0.001    -.1368008   -.0343979
         LD. |   .0128198   .0637361     0.20   0.841    -.1127234     .138363
             |
      _trend |    .000471   .0006746     0.70   0.486    -.0008578    .0017998
       _cons |  -.2042532   .1109369    -1.84   0.067    -.4227694    .0142629
------------------------------------------------------------------------------

. 
. * dfgls sin tendencia. lags optimos = 1
. dfgls y1, notrend
 
DF-GLS for y1                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.629           -2.580            -1.953            -1.642
    14           -1.656           -2.580            -1.958            -1.648
    13           -1.665           -2.580            -1.964            -1.653
    12           -1.559           -2.580            -1.969            -1.658
    11           -1.585           -2.580            -1.974            -1.662
    10           -1.825           -2.580            -1.979            -1.667
    9            -1.864           -2.580            -1.984            -1.672
    8            -1.948           -2.580            -1.989            -1.676
    7            -2.269           -2.580            -1.994            -1.680
    6            -2.495           -2.580            -1.998            -1.685
    5            -2.692           -2.580            -2.003            -1.689
    4            -2.645           -2.580            -2.007            -1.693
    3            -2.899           -2.580            -2.011            -1.696
    2            -2.957           -2.580            -2.015            -1.700
    1            -2.984           -2.580            -2.019            -1.703
 
Opt Lag (Ng-Perron seq t) = 11 with RMSE  .7221808
Min SIC  = -.5477669 at lag  1 with RMSE  .7428978
Min MAIC = -.5266333 at lag 11 with RMSE  .7221808

. 
. *No puedo que es I(0) al 1%
. dfuller y1, lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -3.229            -3.461            -2.880            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0184

------------------------------------------------------------------------------
        D.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         L1. |  -.0829509   .0256889    -3.23   0.001    -.1335503   -.0323516
         LD. |   .0117842   .0636522     0.19   0.853    -.1135911    .1371595
             |
       _cons |  -.1408101   .0635765    -2.21   0.028    -.2660363   -.0155839
------------------------------------------------------------------------------

. 
. * Diferencias, lags optimos = 1
. dfgls D.y1
 
DF-GLS for D.y1                                          Number of obs =   233
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -2.602           -3.480            -2.804            -2.526
    14           -2.658           -3.480            -2.814            -2.535
    13           -2.736           -3.480            -2.824            -2.543
    12           -2.840           -3.480            -2.833            -2.552
    11           -3.054           -3.480            -2.842            -2.560
    10           -3.262           -3.480            -2.851            -2.569
    9            -3.304           -3.480            -2.860            -2.576
    8            -3.647           -3.480            -2.868            -2.584
    7            -4.113           -3.480            -2.876            -2.591
    6            -4.234           -3.480            -2.884            -2.598
    5            -4.534           -3.480            -2.891            -2.605
    4            -4.929           -3.480            -2.898            -2.611
    3            -6.025           -3.480            -2.905            -2.618
    2            -6.832           -3.480            -2.911            -2.623
    1            -8.798           -3.480            -2.917            -2.629
 
Opt Lag (Ng-Perron seq t) = 12 with RMSE  .7634144
Min SIC  = -.3544124 at lag  1 with RMSE  .8182387
Min MAIC = -.1772751 at lag 15 with RMSE  .7542909

. * tendencia determinística no significativa
. dfuller D.y1, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       247

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -11.525            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
       D2.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         LD. |  -1.057902   .0917892   -11.53   0.000    -1.238706   -.8770975
        LD2. |   .0235169    .063874     0.37   0.713    -.1023004    .1493342
             |
      _trend |   .0002042   .0006867     0.30   0.766    -.0011485    .0015569
       _cons |  -.0329783   .0988257    -0.33   0.739    -.2276426     .161686
------------------------------------------------------------------------------

. 
. *lags optimos = 4
. dfgls D.y1, notrend
 
DF-GLS for D.y1                                          Number of obs =   233
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -0.925           -2.580            -1.953            -1.642
    14           -0.983           -2.580            -1.958            -1.648
    13           -1.055           -2.580            -1.964            -1.653
    12           -1.144           -2.580            -1.969            -1.658
    11           -1.323           -2.580            -1.974            -1.663
    10           -1.464           -2.580            -1.979            -1.667
    9            -1.501           -2.580            -1.984            -1.672
    8            -1.731           -2.580            -1.989            -1.676
    7            -2.024           -2.580            -1.994            -1.681
    6            -2.132           -2.580            -1.999            -1.685
    5            -2.340           -2.580            -2.003            -1.689
    4            -2.618           -2.580            -2.007            -1.693
    3            -3.342           -2.580            -2.011            -1.696
    2            -3.973           -2.580            -2.015            -1.700
    1            -5.434           -2.580            -2.019            -1.703
 
Opt Lag (Ng-Perron seq t) = 13 with RMSE  .7681702
Min SIC  =  -.255854 at lag  4 with RMSE  .8299295
Min MAIC = -.4015777 at lag 14 with RMSE  .7640437

. * Serie es I(1) sin tendencia determinística
. dfuller D.y1, lags(4) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       244

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -7.983            -3.462            -2.880            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
       D2.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         LD. |  -1.254355   .1571315    -7.98   0.000    -1.563901   -.9448088
        LD2. |   .2068613   .1353934     1.53   0.128    -.0598612    .4735838
       L2D2. |   .1732743    .114828     1.51   0.133    -.0529348    .3994833
       L3D2. |   .1213927   .0922571     1.32   0.190     -.060352    .3031375
       L4D2. |   .0125078   .0643474     0.19   0.846    -.1142555    .1392711
             |
       _cons |  -.0121318   .0490117    -0.25   0.805    -.1086839    .0844202
------------------------------------------------------------------------------

. 
. 
. *Lags optimos = 1
. dfgls y2
 
DF-GLS for y2                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.839           -3.480            -2.805            -2.526
    14           -1.808           -3.480            -2.814            -2.535
    13           -1.697           -3.480            -2.824            -2.544
    12           -1.904           -3.480            -2.833            -2.552
    11           -1.978           -3.480            -2.842            -2.561
    10           -2.100           -3.480            -2.851            -2.569
    9            -2.257           -3.480            -2.860            -2.576
    8            -2.221           -3.480            -2.868            -2.584
    7            -2.607           -3.480            -2.876            -2.591
    6            -2.558           -3.480            -2.884            -2.598
    5            -2.894           -3.480            -2.891            -2.605
    4            -2.669           -3.480            -2.898            -2.611
    3            -2.797           -3.480            -2.905            -2.617
    2            -2.952           -3.480            -2.911            -2.623
    1            -2.794           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) =  8 with RMSE   .696296
Min SIC  = -.6277113 at lag  1 with RMSE  .7137882
Min MAIC =  -.598586 at lag  8 with RMSE   .696296

. * tendencia determinística no significativa
. dfuller y2, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.988            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1355

------------------------------------------------------------------------------
        D.y2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y2 |
         L1. |  -.0755203   .0252747    -2.99   0.003    -.1253047   -.0257359
         LD. |  -.0330518   .0639947    -0.52   0.606    -.1591044    .0930009
             |
      _trend |   .0005082   .0006527     0.78   0.437    -.0007774    .0017939
       _cons |  -.1747164   .1083499    -1.61   0.108    -.3881368     .038704
------------------------------------------------------------------------------

. 
. * dfgls sin tendencia. lags optimos = 1
. dfgls y2, notrend
 
DF-GLS for y2                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.792           -2.580            -1.953            -1.642
    14           -1.762           -2.580            -1.958            -1.648
    13           -1.651           -2.580            -1.964            -1.653
    12           -1.858           -2.580            -1.969            -1.658
    11           -1.932           -2.580            -1.974            -1.662
    10           -2.055           -2.580            -1.979            -1.667
    9            -2.211           -2.580            -1.984            -1.672
    8            -2.176           -2.580            -1.989            -1.676
    7            -2.556           -2.580            -1.994            -1.680
    6            -2.509           -2.580            -1.998            -1.685
    5            -2.839           -2.580            -2.003            -1.689
    4            -2.619           -2.580            -2.007            -1.693
    3            -2.747           -2.580            -2.011            -1.696
    2            -2.901           -2.580            -2.015            -1.700
    1            -2.749           -2.580            -2.019            -1.703
 
Opt Lag (Ng-Perron seq t) =  8 with RMSE  .6965799
Min SIC  = -.6266707 at lag  1 with RMSE  .7141597
Min MAIC = -.6005143 at lag  8 with RMSE  .6965799

. 
. *No puedo que es I(0) al 1%
. dfuller y2, lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.887            -3.461            -2.880            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0469

------------------------------------------------------------------------------
        D.y2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y2 |
         L1. |   -.070483   .0244132    -2.89   0.004    -.1185695   -.0223966
         LD. |  -.0355866   .0638605    -0.56   0.578    -.1613723    .0901991
             |
       _cons |  -.1034406   .0579277    -1.79   0.075    -.2175403    .0106592
------------------------------------------------------------------------------

. 
. * Diferencias, lags optimos = 1
. dfgls D.y2
 
DF-GLS for D.y2                                          Number of obs =   233
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -4.677           -3.480            -2.804            -2.526
    14           -4.426           -3.480            -2.814            -2.535
    13           -4.832           -3.480            -2.824            -2.543
    12           -5.603           -3.480            -2.833            -2.552
    11           -5.517           -3.480            -2.842            -2.560
    10           -5.809           -3.480            -2.851            -2.569
    9            -5.914           -3.480            -2.860            -2.576
    8            -5.895           -3.480            -2.868            -2.584
    7            -6.638           -3.480            -2.876            -2.591
    6            -6.225           -3.480            -2.884            -2.598
    5            -7.061           -3.480            -2.891            -2.605
    4            -6.856           -3.480            -2.898            -2.611
    3            -8.533           -3.480            -2.905            -2.618
    2            -9.407           -3.480            -2.911            -2.623
    1           -10.773           -3.480            -2.917            -2.629
 
Opt Lag (Ng-Perron seq t) =  7 with RMSE  .7019397
Min SIC  = -.6077132 at lag  1 with RMSE  .7209023
Min MAIC =  1.523921 at lag  1 with RMSE  .7209023

. * tendencia determinística no significativa
. dfuller D.y2, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       247

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -11.067            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
       D2.y2 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y2 |
         LD. |  -1.040115   .0939829   -11.07   0.000     -1.22524   -.8549904
        LD2. |  -.0290961   .0642359    -0.45   0.651    -.1556263    .0974342
             |
      _trend |  -.0000318   .0006469    -0.05   0.961     -.001306    .0012424
       _cons |   .0072394   .0930886     0.08   0.938    -.1761242     .190603
------------------------------------------------------------------------------

. 
. *lags optimos = 1
. dfgls D.y2, notrend
 
DF-GLS for D.y2                                          Number of obs =   233
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -3.794           -2.580            -1.953            -1.642
    14           -3.658           -2.580            -1.958            -1.648
    13           -4.051           -2.580            -1.964            -1.653
    12           -4.762           -2.580            -1.969            -1.658
    11           -4.781           -2.580            -1.974            -1.663
    10           -5.114           -2.580            -1.979            -1.667
    9            -5.295           -2.580            -1.984            -1.672
    8            -5.358           -2.580            -1.989            -1.676
    7            -6.104           -2.580            -1.994            -1.681
    6            -5.799           -2.580            -1.999            -1.685
    5            -6.642           -2.580            -2.003            -1.689
    4            -6.510           -2.580            -2.007            -1.693
    3            -8.163           -2.580            -2.011            -1.696
    2            -9.090           -2.580            -2.015            -1.700
    1           -10.504           -2.580            -2.019            -1.703
 
Opt Lag (Ng-Perron seq t) =  7 with RMSE  .7110208
Min SIC  =  -.591023 at lag  1 with RMSE  .7269435
Min MAIC =  1.368465 at lag  4 with RMSE  .7212718

. * Serie es I(1) sin tendencia determinística
. dfuller D.y1, lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       247

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -11.544            -3.461            -2.880            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
       D2.y1 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y1 |
         LD. |  -1.057525   .0916089   -11.54   0.000     -1.23797     -.87708
        LD2. |   .0234405    .063754     0.37   0.713     -.102138     .149019
             |
       _cons |  -.0074558   .0488681    -0.15   0.879    -.1037129    .0888014
------------------------------------------------------------------------------

. 
. 
. 
. *Lags optimos = 1
. dfgls y3
 
DF-GLS for y3                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.535           -3.480            -2.805            -2.526
    14           -1.535           -3.480            -2.814            -2.535
    13           -1.510           -3.480            -2.824            -2.544
    12           -1.553           -3.480            -2.833            -2.552
    11           -1.568           -3.480            -2.842            -2.561
    10           -1.743           -3.480            -2.851            -2.569
    9            -1.820           -3.480            -2.860            -2.576
    8            -1.912           -3.480            -2.868            -2.584
    7            -2.092           -3.480            -2.876            -2.591
    6            -2.214           -3.480            -2.884            -2.598
    5            -2.294           -3.480            -2.891            -2.605
    4            -2.342           -3.480            -2.898            -2.611
    3            -2.328           -3.480            -2.905            -2.617
    2            -2.363           -3.480            -2.911            -2.623
    1            -2.245           -3.480            -2.917            -2.628
 
Opt Lag (Ng-Perron seq t) = 0 [use maxlag(0)]
Min SIC  = -1.287578 at lag  1 with RMSE  .5131935
Min MAIC = -1.281131 at lag  1 with RMSE  .5131935

. * tendencia determinística no significativa
. dfuller y3, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.466            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.3454

------------------------------------------------------------------------------
        D.y3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y3 |
         L1. |   -.052591   .0213297    -2.47   0.014    -.0946049   -.0105772
         LD. |  -.0699691   .0637993    -1.10   0.274    -.1956367    .0556985
             |
      _trend |   .0002533   .0004692     0.54   0.590     -.000671    .0011775
       _cons |  -.1218543   .0804391    -1.51   0.131    -.2802979    .0365893
------------------------------------------------------------------------------

. 
. * dfgls sin tendencia. lags optimos = 1
. dfgls y3, notrend
 
DF-GLS for y3                                            Number of obs =   234
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.488           -2.580            -1.953            -1.642
    14           -1.488           -2.580            -1.958            -1.648
    13           -1.465           -2.580            -1.964            -1.653
    12           -1.507           -2.580            -1.969            -1.658
    11           -1.521           -2.580            -1.974            -1.662
    10           -1.690           -2.580            -1.979            -1.667
    9            -1.765           -2.580            -1.984            -1.672
    8            -1.856           -2.580            -1.989            -1.676
    7            -2.032           -2.580            -1.994            -1.680
    6            -2.154           -2.580            -1.998            -1.685
    5            -2.233           -2.580            -2.003            -1.689
    4            -2.282           -2.580            -2.007            -1.693
    3            -2.268           -2.580            -2.011            -1.696
    2            -2.304           -2.580            -2.015            -1.700
    1            -2.187           -2.580            -2.019            -1.703
 
Opt Lag (Ng-Perron seq t) = 0 [use maxlag(0)]
Min SIC  =   -1.2865 at lag  1 with RMSE  .5134702
Min MAIC = -1.282345 at lag  1 with RMSE  .5134702

. 
. *No puedo que es I(0) al 1%
. dfuller y3, lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       248

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)             -2.410            -3.461            -2.880            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.1388

------------------------------------------------------------------------------
        D.y3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y3 |
         L1. |  -.0503893   .0209057    -2.41   0.017    -.0915671   -.0092115
         LD. |  -.0709793   .0636795    -1.11   0.266    -.1964084    .0544498
             |
       _cons |  -.0865677   .0467966    -1.85   0.066    -.1787428    .0056073
------------------------------------------------------------------------------

. 
. * Diferencias, lags optimos = 1
. dfgls D.y3
 
DF-GLS for D.y3                                          Number of obs =   233
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS tau      1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -3.155           -3.480            -2.804            -2.526
    14           -3.363           -3.480            -2.814            -2.535
    13           -3.605           -3.480            -2.824            -2.543
    12           -3.958           -3.480            -2.833            -2.552
    11           -4.260           -3.480            -2.842            -2.560
    10           -4.682           -3.480            -2.851            -2.569
    9            -4.739           -3.480            -2.860            -2.576
    8            -5.017           -3.480            -2.868            -2.584
    7            -5.371           -3.480            -2.876            -2.591
    6            -5.499           -3.480            -2.884            -2.598
    5            -5.793           -3.480            -2.891            -2.605
    4            -6.268           -3.480            -2.898            -2.611
    3            -6.994           -3.480            -2.905            -2.618
    2            -8.231           -3.480            -2.911            -2.623
    1           -10.097           -3.480            -2.917            -2.629
 
Opt Lag (Ng-Perron seq t) = 0 [use maxlag(0)]
Min SIC  = -1.223927 at lag  1 with RMSE  .5297456
Min MAIC = -.2461309 at lag 15 with RMSE  .5217266

. * tendencia determinística no significativa
. dfuller D.y3, trend lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       247

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -11.326            -3.991            -3.430            -3.130
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
       D2.y3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y3 |
         LD. |  -1.073326   .0947658   -11.33   0.000    -1.259993   -.8866587
        LD2. |  -.0185055   .0640036    -0.29   0.773    -.1445781    .1075671
             |
      _trend |  -.0000175   .0004691    -0.04   0.970    -.0009415    .0009066
       _cons |  -.0020876   .0675111    -0.03   0.975    -.1350692     .130894
------------------------------------------------------------------------------

. 
. *lags optimos = 1
. dfgls D.y3, notrend
 
DF-GLS for D.y3                                          Number of obs =   233
Maxlag = 15 chosen by Schwert criterion
 
               DF-GLS mu       1% Critical       5% Critical      10% Critical
  [lags]     Test Statistic        Value             Value             Value
------------------------------------------------------------------------------
    15           -1.571           -2.580            -1.953            -1.642
    14           -1.731           -2.580            -1.958            -1.648
    13           -1.909           -2.580            -1.964            -1.653
    12           -2.175           -2.580            -1.969            -1.658
    11           -2.414           -2.580            -1.974            -1.663
    10           -2.737           -2.580            -1.979            -1.667
    9            -2.836           -2.580            -1.984            -1.672
    8            -3.105           -2.580            -1.989            -1.676
    7            -3.432           -2.580            -1.994            -1.681
    6            -3.624           -2.580            -1.999            -1.685
    5            -3.942           -2.580            -2.003            -1.689
    4            -4.411           -2.580            -2.007            -1.693
    3            -5.106           -2.580            -2.011            -1.696
    2            -6.265           -2.580            -2.015            -1.700
    1            -8.064           -2.580            -2.019            -1.703
 
Opt Lag (Ng-Perron seq t) = 13 with RMSE  .5346605
Min SIC  = -1.106429 at lag  1 with RMSE  .5617999
Min MAIC = -1.040969 at lag 15 with RMSE  .5302114

. * Serie es I(1) sin tendencia determinística
. dfuller D.y3, lags(1) regress

Augmented Dickey-Fuller test for unit root         Number of obs   =       247

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -11.350            -3.461            -2.880            -2.570
------------------------------------------------------------------------------
MacKinnon approximate p-value for Z(t) = 0.0000

------------------------------------------------------------------------------
       D2.y3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
          y3 |
         LD. |  -1.073344   .0945704   -11.35   0.000    -1.259622   -.8870651
        LD2. |  -.0185045   .0638725    -0.29   0.772    -.1443162    .1073073
             |
       _cons |  -.0042698   .0333824    -0.13   0.898    -.0700243    .0614847
------------------------------------------------------------------------------

. 
. * 4)
. tsline y1 y2 y3

. 
. * 5) Usaremos 1 lag según criterio de Schwartz
. varsoc y1 y2 y3

   Selection-order criteria
   Sample:  5 - 250                             Number of obs      =       246
  +---------------------------------------------------------------------------+
  |lag |    LL      LR      df    p      FPE       AIC      HQIC      SBIC    |
  |----+----------------------------------------------------------------------|
  |  0 | -983.155                      .608892   8.01752   8.03473   8.06026  |
  |  1 |  -523.26  919.79    9  0.000  .015578   4.35171   4.42056*   4.5227* |
  |  2 | -513.856  18.807*   9  0.027  .015527*  4.34842*  4.46891   4.64766  |
  |  3 | -509.991    7.73    9  0.562  .016191   4.39017    4.5623   4.81765  |
  |  4 | -504.345  11.292    9  0.256  .016641   4.41744    4.6412   4.97316  |
  +---------------------------------------------------------------------------+
   Endogenous:  y1 y2 y3
    Exogenous:  _cons

. 
. * 6) No rechazo r=2 (traza) ni r<=2 (max) en los tests. Hay 2 relaciones de cointegración
. vecrank y1 y2 y3, trend(none) lags(1) max levela

                       Johansen tests for cointegration                        
Trend: none                                             Number of obs =     249
Sample:  2 - 250                                                 Lags =       1
-------------------------------------------------------------------------------
maximum                                      trace     5% critical  1% critical
  rank    parms       LL       eigenvalue  statistic      value        value
    0      0       -577.2724                 81.4999      24.31        29.75
    1      5      -554.44416     0.16753     35.8435      12.53        16.31
    2      8      -538.19988     0.12232      3.3549*1*5   3.84         6.51
    3      9      -536.52243     0.01338
-------------------------------------------------------------------------------
maximum                                       max      5% critical  1% critical
  rank    parms       LL       eigenvalue  statistic      value        value
    0      0       -577.2724                 45.6565      17.89        22.99
    1      5      -554.44416     0.16753     32.4886      11.44        15.69
    2      8      -538.19988     0.12232      3.3549       3.84         6.51
    3      9      -536.52243     0.01338
-------------------------------------------------------------------------------

. 
. * 7)
. vec y1 y2 y3, trend(none) rank(2) lags(1)

Vector error-correction model

Sample:  2 - 250                                Number of obs     =        249
                                                AIC               =   4.387148
Log likelihood = -538.1999                      HQIC              =   4.432636
Det(Sigma_ml)  =  .0151351                      SBIC              =   4.500158

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
D_y1                  2     .751167   0.0415   10.68241   0.0048
D_y2                  2     .703737   0.0492   12.77106   0.0017
D_y3                  2      .52195   0.0130   3.243853   0.1975
----------------------------------------------------------------

------------------------------------------------------------------------------
             |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
D_y1         |
        _ce1 |
         L1. |  -.2122357   .0650152    -3.26   0.001    -.3396631   -.0848083
             |
        _ce2 |
         L1. |  -.0399952   .0686175    -0.58   0.560    -.1744831    .0944927
-------------+----------------------------------------------------------------
D_y2         |
        _ce1 |
         L1. |   .0899136     .06091     1.48   0.140    -.0294678    .2092951
             |
        _ce2 |
         L1. |  -.1951678   .0642849    -3.04   0.002    -.3211639   -.0691716
-------------+----------------------------------------------------------------
D_y3         |
        _ce1 |
         L1. |   .0634815   .0451759     1.41   0.160    -.0250617    .1520247
             |
        _ce2 |
         L1. |   .0619392    .047679     1.30   0.194      -.03151    .1553884
------------------------------------------------------------------------------

Cointegrating equations

Equation           Parms    chi2     P>chi2
-------------------------------------------
_ce1                  1   430.4658   0.0000
_ce2                  1   408.8831   0.0000
-------------------------------------------

Identification:  beta is exactly identified

                 Johansen normalization restrictions imposed
------------------------------------------------------------------------------
        beta |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
_ce1         |
          y1 |          1          .        .       .            .           .
          y2 |   1.11e-16          .        .       .            .           .
          y3 |  -1.065573   .0513587   -20.75   0.000    -1.166235   -.9649122
-------------+----------------------------------------------------------------
_ce2         |
          y1 |  -5.55e-17          .        .       .            .           .
          y2 |          1          .        .       .            .           .
          y3 |  -1.009138   .0499058   -20.22   0.000    -1.106952   -.9113245
------------------------------------------------------------------------------

. 
. * 8)
. * Pi es 3x3 y capta el efecto total a largo plazo. Es de rango reducido (2)
. matrix list e(pi)

e(pi)[1,9]
          D_y1:       D_y1:       D_y1:       D_y2:       D_y2:       D_y2:       D_y3:       D_y3:       D_y3:
             L.          L.          L.          L.          L.          L.          L.          L.          L.
            y1          y2          y3          y1          y2          y3          y1          y2          y3
pi  -.21223571  -.03999518   .26651338   .08991364  -.19516776   .10114164   .06348152   .06193917   -.1301494

. 
. * alpha es 3x2. 3 variables y 2 relaciones de cointegración. Corrección de desvios en el corto plazo
. matrix list e(alpha)

e(alpha)[1,6]
             D_y1:       D_y1:       D_y2:       D_y2:       D_y3:       D_y3:
                L.          L.          L.          L.          L.          L.
             _ce1        _ce2        _ce1        _ce2        _ce1        _ce2
alpha  -.21223571  -.03999518   .08991364  -.19516776   .06348152   .06193917

. 
. * Beta son los vectores de cointegración 2x3 que capta la relación a largo plazo
. matrix list e(beta)

e(beta)[1,6]
            _ce1:       _ce1:       _ce1:       _ce2:       _ce2:       _ce2:
              y1          y2          y3          y1          y2          y3
beta           1   1.110e-16  -1.0655734  -5.551e-17           1  -1.0091381

. 
. * 9) Test de autocorrelación de errores. No puedo rechazar no autocorrelación
. veclmar

   Lagrange-multiplier test
  +--------------------------------------+
  | lag  |      chi2    df   Prob > chi2 |
  |------+-------------------------------|
  |   1  |   11.3492     9     0.25253   |
  |   2  |    6.1255     9     0.72730   |
  +--------------------------------------+
   H0: no autocorrelation at lag order

. 
. * 10) Dos raíces dentro del círculo unitario.
. * La otra es exactamente unitaria producto de la integración de primer orden. Es estable
. vecstable, graph

   Eigenvalue stability condition
  +----------------------------------------+
  |        Eigenvalue        |   Modulus   |
  |--------------------------+-------------|
  |          1               |         1   |
  |   .7312236 + .05115585i  |   .733011   |
  |   .7312236 - .05115585i  |   .733011   |
  +----------------------------------------+
   The VECM specification imposes a unit modulus.

. 
. log close
      name:  <unnamed>
       log:  G:\Other computers\Mi portátil\Facultad\Pronosticos\Ejs Pronosticos\EjPronosticos10\Ej10_log.log
  log type:  text
 closed on:   2 Jun 2025, 17:43:25
---------------------------------------------------------------------------------------------------------------------------------------
